# 函数的含义: 可以被重复使用的代码块
# 函数的使用步骤:
# 1.定义函数, 封装独立的功能
# 定义函数的语法, def 是 define 的缩写, 函数名遵循标识符的命名规范
# 定义过程, 只定义, 不执行
# def 函数名():
#     代码
# 2.调用函数, 使用封装好的功能
# 调用函数的语法, 调用函数时会实际执行
# 函数名()
# def fozu():
#     print("                            _ooOoo_  ")
#     print("                           o8888888o  ")
#     print("                           88  .  88  ")
#     print("                           (| -_- |)  ")
#     print("                            O\\ = /O  ")
#     print("                        ____/`---'\\____  ")
#     print("                      .   ' \\| |// `.  ")
#     print("                       / \\||| : |||// \\  ")
#     print("                     / _||||| -:- |||||- \\  ")
#     print("                       | | \\\\\\ - /// | |  ")
#     print("                     | \\_| ''\\---/'' | |  ")
#     print("                      \\ .-\\__ `-` ___/-. /  ")
#     print("                   ___`. .' /--.--\\ `. . __  ")
#     print("                ."" '< `.___\\_<|>_/___.' >'"".  ")
#     print("               | | : `- \\`.;`\\ _ /`;.`/ - ` : | |  ")
#     print("                 \\ \\ `-. \\_ __\\ /__ _/ .-` / /  ")
#     print("         ======`-.____`-.___\\_____/___.-`____.-'======  ")
#     print("                            `=---='  ")
#     print("  ")
#     print("         .............................................  ")
#     print("                  佛祖镇楼                  BUG辟易  ")
#     print("          佛曰:  ")
#     print("                  写字楼里写字间，写字间里程序员；  ")
#     print("                  程序人员写程序，又拿程序换酒钱。  ")
#
# fozu()

# 查看函数的使用文档, 使用 help()
print(help(len))

def fozu():
    pass